app/Http/Controllers/Site/HomeController.php

select * from `site_post` where `parent` = '0' and `type` = 'category' and `status` = 'public'
select * from `site_post` where `parent` = 18 and `type` = 'category' and `status` = 'public'
select * from `site_post` where `parent` = 1 and `type` = 'category' and `status` = 'public'
select `id` from `site_post` where `status` = 'public' and `slug` = 'tin-tuc' limit 1
select * from `site_post` where `status` = 'public' and `parent` = 19 order by `created_at` desc
---
  function __construct()
  {
    $configs = SiteConfigModel::first();
    $categories = SitePostModel::where('parent', '0')->where('type', 'category')->where('status', 'public')->get();
    if (count($categories) > 0) {
      foreach ($categories as $category) {
        $category->child = SitePostModel::where('parent', $category->id)->where('type', 'category')->where('status', 'public')->get();
        if (count($category->child) > 0) {
          foreach ($category->child as $child) {
            $child->child = SitePostModel::where('parent', $child->id)->where('type', 'category')->where('status', 'public')->get();
          }
        }
      }
    }
    $news_id = SitePostModel::select('id')->where('status', 'public')->where('slug', 'tin-tuc')->first();
    if (@count($news_id) > 0) {
      $rs = SitePostModel::where('status', 'public')->where('parent', $news_id->id)->orderBy('created_at', 'DESC')->get();