app/Http/Controllers/Cms/CateProductController.php

  function __construct()
  {
    $this->middleware(function (Request $request, $next) {
      $categories_list = SitePostModel::where('type', 'category')->orderBy('order', 'DESC')->get();
      view()->share(['module' => 'danh-muc/list', 'categories_list' => $categories_list]);
      $this->module = 'danh-muc';
      return $next($request);
    });
---
select * from `site_post` where `type` = 'category' order by `order` desc